In [2]:
import pandas as pd
import numpy as np

In [20]:
evaluation = pd.read_csv("evaluation.csv", delimiter="|")
APU = pd.read_csv("Uni_Asia_Pacific_1.csv", delimiter="|")

In [21]:
evaluation.head(5)

   itemID
0      12
1   45274
2   10104
3   41371
4   14015

In [22]:
APU.head(5)

   itemID   rec1   rec2   rec3   rec4   rec5
0      12  72603  11989  11117   3106  44220
1   45274  14576  73124  33976  63166  54393
2   41371  14576  73124  33976  63166  54393
3   14015  72603  11989  11117   3106  44220
4   70766  72603  11989  11117   3106  44220

In [23]:
print(evaluation.shape)
print(APU.shape)

(1000, 1)
(1037, 6)

In [24]:
test = pd.merge(APU, evaluation, how='inner', on=["itemID"])

In [25]:
test.shape

(1037, 6)

In [26]:
test.head(10)

   itemID   rec1   rec2   rec3   rec4   rec5
0      12  72603  11989  11117   3106  44220
1   45274  14576  73124  33976  63166  54393
2   41371  14576  73124  33976  63166  54393
3   41371  58723   2408  30277  29508  15581
4   14015  72603  11989  11117   3106  44220
5   70766  72603  11989  11117   3106  44220
6   70766   4892  44815  63847  64544   2417
7    1822  72603  11989  11117   3106  44220
8    1822   4892  44815  63847  64544   2417
9   56794  72603  11989  11117   3106  44220

In [28]:
print(test['itemID'].value_counts())

50338    2
2074     2
2335     2
13269    2
7129     2
        ..
68427    1
11609    1
68560    1
9179     1
30725    1
Name: itemID, Length: 630, dtype: int64

In [44]:
# create DF to show the itemID where count is = 1 or = 2
df_1 = test.groupby('itemID').filter(lambda x: len(x) == 1)
df_2 = test.groupby('itemID').filter(lambda x: len(x) == 2)

print(df_1.shape)
print(df_2.shape)

(223, 6)
(814, 6)

In [53]:
df_1.head(10)

    itemID   rec1   rec2   rec3   rec4   rec5
0       12  72603  11989  11117   3106  44220
1    45274  14576  73124  33976  63166  54393
4    14015  72603  11989  11117   3106  44220
19   39779  72603  11989  11117   3106  44220
26   65307  72603  11989  11117   3106  44220
43   71586  72603  11989  11117   3106  44220
52   15657  72603  11989  11117   3106  44220
59   43844  72603  11989  11117   3106  44220
80    9365  72603  11989  11117   3106  44220
81   11177  72603  11989  11117   3106  44220

In [54]:
df_2.head(20)

    itemID   rec1   rec2   rec3   rec4   rec5
2    41371  14576  73124  33976  63166  54393
5    70766  72603  11989  11117   3106  44220
7     1822  72603  11989  11117   3106  44220
9    56794  72603  11989  11117   3106  44220
11   73378  72603  11989  11117   3106  44220
13   24603  72603  11989  11117   3106  44220
15    5737   4892  63847  53706  26528   7464
17   38980  72603  11989  11117   3106  44220
20   51066  72603  11989  11117   3106  44220
22   67776  14576  73124  33976  63166  54393
24   53929  14576  73124  33976  63166  54393
27   62494   4892  63847  53706  26528   7464
29   53008  72603  11989  11117   3106  44220
31    4690  17731  29508  55699  62433   4283
33   65353  14576  73124  33976  63166  54393
35   61593  14576  73124  33976  63166  54393
37   18537  17342  23574  10522  25881   1193
39   73427  72603  11989  11117   3106  44220
41    7521  72603  11989  11117   3106  44220
44   13772  72603  11989  11117   3106  44220

In [55]:
#Remove duplicate 

test.drop_duplicates(subset ="itemID", keep='first' ,inplace=True)
test

      itemID   rec1   rec2   rec3   rec4   rec5
0         12  72603  11989  11117   3106  44220
1      45274  14576  73124  33976  63166  54393
2      41371  14576  73124  33976  63166  54393
4      14015  72603  11989  11117   3106  44220
5      70766  72603  11989  11117   3106  44220
...      ...    ...    ...    ...    ...    ...
1032   39201   4892  44815  63847  64544   2417
1033   26764   4892  44815  63847  64544   2417
1034   14782  75659   3106   4283  31293  71747
1035   17138  58723   2408  30277  29508  15581
1036   23570  63166  54393  56766  75990  66314

[630 rows x 6 columns]

In [58]:
#Create dataframe that are match after merging
match_df = pd.merge(test, evaluation, how='inner', on=["itemID"])
match_df.shape

(630, 6)

In [60]:
match_df

     itemID   rec1   rec2   rec3   rec4   rec5
0        12  72603  11989  11117   3106  44220
1     45274  14576  73124  33976  63166  54393
2     41371  14576  73124  33976  63166  54393
3     14015  72603  11989  11117   3106  44220
4     70766  72603  11989  11117   3106  44220
..      ...    ...    ...    ...    ...    ...
625   39201   4892  44815  63847  64544   2417
626   26764   4892  44815  63847  64544   2417
627   14782  75659   3106   4283  31293  71747
628   17138  58723   2408  30277  29508  15581
629   23570  63166  54393  56766  75990  66314

[630 rows x 6 columns]

## 370 itemID not match with evaluation CSV

In [63]:
#Create dataframe that are not match

notmatch_df = evaluation[~evaluation.itemID.isin(match_df.itemID)]
notmatch_df

     itemID
2     10104
5     28515
9     60188
11    31401
12     6420
..      ...
989    2706
991    9569
992   50163
995   78384
999   41078

[370 rows x 1 columns]

In [66]:
items = pd.read_csv("items.csv", delimiter="|")
transaction = pd.read_csv("transactions.csv", delimiter="|")

data = pd.merge(items, transaction, on=["itemID"])
data

,itemID,title,author,publisher,main topic,subtopics,sessionID,click,basket,order
0,21310,Princess Poppy: The Big Mix Up,Janey Louise Jones,Penguin Random House Children's UK,YFB,[5AH],0,1,0,0
1,21310,Princess Poppy: The Big Mix Up,Janey Louise Jones,Penguin Random House Children's UK,YFB,[5AH],89272,1,0,0
2,21310,Princess Poppy: The Big Mix Up,Janey Louise Jones,Penguin Random House Children's UK,YFB,[5AH],183856,1,0,0
3,73018,Einfach zeichnen! Step by Step,Wiebke Krabbe,Schwager und Steinlein,AGZ,"[5AJ,AGZ,WFA,YBG,YBL,YNA,YPA]",1,1,0,0
4,73018,Einfach zeichnen! Step by Step,Wiebke Krabbe,Schwager und Steinlein,AGZ,"[5AJ,AGZ,WFA,YBG,YBL,YNA,YPA]",771,1,0,0
...,...,...,...,...,...,...,...,...,...,...
365138,21264,Soon,Morris Gleitzman,Penguin Random House Children's UK,YFN,[5AL],279176,1,0,0
365139,22297,Warum? Fragen u. Antworten f. Kleinkinder - In...,NaN,Yo Yo Books,YBC,[YBL],279210,1,0,0
365140,56041,Tesla,Mark Lingane,Insync Holdings Pty Ltd,FLM,[],279248,1,0,0
365141,67832,Hexenherz. Glühender Hass,Monika Loerchner,Acabus Verlag,FMH,"[1D,FMH,FMR]",279343,2,0,0
365142,73084,Everybody Sees the Ants,A. S. King,LITTLE BROWN & CO,YXQF,"[YF,YXD,YXE]",279350,1,0,0

## 368 itemID found in items CSV

In [71]:
#Merge 
DF_1 = pd.merge(items, notmatch_df, on=["itemID"])
DF_1

,itemID,title,author,publisher,main topic,subtopics
0,75904,The Testaments,Margaret Atwood,Random House UK Ltd,JBSF11,"[FBA,FDB,FL,FXP]"
1,56300,Die Maus - Meine Kindergarten-Freunde,NaN,Ars Edition GmbH,Y,"[5A,5AC,YB,YF]"
2,636,A Song of Ice and Fire 05. A Dance with Dragons,George R. R. Martin,Harper Collins Publ. UK,FL,[FM]
3,21276,Wilder Girls,Rory Power,Random House LCC US,YNMF,"[YFB,YFG,YFS]"
4,48659,Die Splitter der Macht,Brandon Sanderson,Heyne Verlag,FMB,"[FMB,FYT]"
...,...,...,...,...,...,...
363,29972,SOME LITTLE SECRETS,Taylor Rose Rusen,"Booklocker.com, Inc.",YFB,[YX]
364,54145,Mother Osprey: Nursery Rhymes for Buoys and Gulls,Lucy Nolan,ARBORDALE PUB,YFQ,"[1KBB,YFP]"
365,1460,Sock City,Barbara Batchelor,Xlibris,YFQ,[]
366,38964,1001 Arabian Nights - The Complete Adventures ...,Anonymous,EL PASO NORTE PR,YFJ,[]
367,5733,Wilde Stories 2009,NaN,Lethe Press,DNT,[FL]

In [72]:
print(DF_1['itemID'].value_counts())

3583     1
47464    1
34978    1
62115    1
39076    1
        ..
59732    1
70997    1
53078    1
78314    1
39941    1
Name: itemID, Length: 368, dtype: int64

## 2 itemID not found in items CSV

In [73]:
#Create dataframe with itemID that are not found in both evaluation and items csv

notmatch_df_1 = evaluation[~evaluation.itemID.isin(DF_1.itemID)&(~evaluation.itemID.isin(match_df.itemID))]
notmatch_df_1

     itemID
281   37378
575   47675

In [75]:
#Verify whether these 2 itemID are in items

#Create dataframe
verify_df = pd.merge(items, notmatch_df_1, on=["itemID"])
verify_df

Empty DataFrame
Columns: [itemID, title, author, publisher, main topic, subtopics]
Index: []

## Both itemID are not found in items CSV
## So I create csv using "DF_1" with 368 rows

In [77]:
new_df = DF_1.to_csv("new_df.csv", index=False)